**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.2 - 07.06.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c SLCJOB_VERSION '1.2';
dcl-c SLCJOB_DATE '07.06.2026';
