      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.1 - 23.05.2013 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     D SLCJOB_VERSION...
     D                 C                   '1.1'
     D SLCJOB_DATE...
     D                 C                   '23.05.2013'
